
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.Записать();
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	//блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	//старая метода
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ПеремещениеСписокНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.Перемещение.СписокНоменклатуры КАК ПеремещениеСписокНоменклатуры
		|ГДЕ
		|	ПеремещениеСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	втТЧТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстаток,
		|	втТЧТовары.Номенклатура.ПроцентНаценки КАК ПроцентНаценки
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втТЧТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТЧТовары КАК втТЧТовары)) КАК ОстаткиНоменклатурыОстатки
		|		ПО втТЧТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Подразделение", Справочники.Подразделения.ОтделЗакупок);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
		     Отказ = истина;
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = СтрШаблон("не хватает %1 в кол-ве %2",
			 							Выборка.НоменклатураПредставление,
										Выборка.Количество - Выборка.КоличествоОстаток);
			 Сообщение.Сообщить();
		 КонецЕсли;
		 Если Отказ Тогда
		 	Продолжить;
		КонецЕсли;
		Себестоимость = (Выборка.СебестоимостьОстаток / Выборка.КоличествоОстаток * Выборка.Количество);
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Подразделение = Справочники.Подразделения.ОтделЗакупок;
		Движение.Количество = Выборка.Количество;
		Движение.Себестоимость = Себестоимость;	
		
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Подразделение = ТорговаяТочка;
		Движение.Количество = Выборка.Количество;
		Движение.Себестоимость = Себестоимость + Себестоимость * Выборка.ПроцентНаценки / 100;		
	КонецЦикла;
	
КонецПроцедуры
