
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаОтгружено = СтрокаТЧ.КоличествоОтгружено * СтрокаТЧ.Цена;
	СтрокаТЧ.СуммаПринято = СтрокаТЧ.КоличествоПринято * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаОтгружено = СтрокаТЧ.КоличествоОтгружено * СтрокаТЧ.Цена;
    
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПринятоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.СуммаПринято = СтрокаТЧ.КоличествоПринято * СтрокаТЧ.Цена;
КонецПроцедуры
