
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументуОтгружено = СписокНоменклатуры.Итог("СуммаОтгружено");
	СуммаПоДокументуПринято = СписокНоменклатуры.Итог("СуммаПринято");
	
	Для каждого СтрокаТЧ Из СписокНоменклатуры Цикл
	
		Если строкаТЧ.КоличествоОтгружено < СтрокаТЧ.КоличествоПринято Тогда
		      Отказ = Истина;
			  Сообщение = Новый СообщениеПользователю;
			  Сообщение.Текст = "принято больше отгружено!";
			  Сообщение.Сообщить();
			
		
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ТоварыОтгружены.Записывать = Истина;
	Движения.ТоварыПриняты.Записывать = Истина;
    Движения.Взаиморасчеты.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.КоличествоОтгружено) КАК КоличествоОтгружено,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.КоличествоПринято) КАК КоличествоПринято,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.СуммаОтгружено) КАК СебестоимостьОтгруженых,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято) КАК СебестоимостьПринятых,
		|	&Период КАК Период,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка КАК Накладная,
		|	РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято КАК СуммаКОплате
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка,
		|	РасходнаяНакладнаяСписокНоменклатуры.СуммаПринято";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыОтгружены.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);

		Движение = Движения.ТоварыПриняты.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

