
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыОстатки.Накладная КАК Накладная,
		|	ВзаиморасчетыОстатки.Валюта КАК Валюта,
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(
		|			&МоментВремени,
		|			Контрагент = &Контрагент
		|				И Накладная = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ВзаиморасчетыОстатки,
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Валюта",Валюта);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	     //если есть аванс списывем сначала с него а потом выставляем долг
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		Если Выборка.Курс = 0 Тогда
		    Отказ = Истина;
			Сообщить("не зад валюта");
		КонецЕсли;
		Если Выборка.СуммаОстаток > 0 Тогда
            Если Выборка.СуммаОстаток >= СуммаПоДокументу * Выборка.Курс Тогда
			    //если аванс больше долга
				Движение = Движения.Взаиморасчеты.ДобавитьРасход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
				Движение.период = Дата;
				Движение.Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();
				Движение.Сумма = СуммаПоДокументу * Выборка.Курс;				
			Иначе
				//списываем весь аванс
				Движение = Движения.Взаиморасчеты.ДобавитьРасход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
				Движение.период = Дата;
				Движение.Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();
				Движение.Сумма = Выборка.СуммаОстаток;
				//зачисляем долг
				Движение = Движения.Взаиморасчеты.ДобавитьПриход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Валюта;
				Движение.период = Дата;
				Движение.Накладная = Ссылка;
				Движение.Сумма = СуммаПоДокументу  - Выборка.СуммаОстаток / Выборка.Курс;
			КонецЕсли;
	

		КонецЕсли;
	
	КонецЕсли;
	
 
	
КонецПроцедуры
