
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыОстатки.Накладная КАК Накладная,
		|	ВзаиморасчетыОстатки.СуммаДолгаОстаток КАК СуммаДолга
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВзаиморасчетыОстатки.Накладная.МоментВремени";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СуммаСписать = СуммаОплаты;
	Пока Выборка.Следующий() И СуммаОплаты > 0 Цикл 
		ТекСумма = Мин(СуммаОплаты, Выборка.СуммаДолга);
		Движение = Движения.Взаиморасчеты.ДобавитьРасход();
		движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		движение.Накладная = Выборка.Накладная;
		Движение.СуммаДолга = ТекСумма;
		СуммаОплаты = СуммаОплаты - ТекСумма;
	КонецЦикла;
	
КонецПроцедуры
